{
  "selectors": ["Home", "Skills", "Certifications", "Experience"],
  "home": {
    "alias": "Joseph Adames",
    "avatar": "",
    "statement": "Hey",
    "About": {
      "statement": "Experienced Front End Developer with a proven track record in leading, architecting, and building projects with modern JavaScript. Seeking to leverage expertise in JavaScript, Javascript Frameworks, and Node to contribute to a dynamic team, enhance client business objectives, and craft exceptional web-based applications.",
      "bullets": [
        "Well-versed in the architectural concepts behind React, including state and data management, JSX, and creating a componentized system.",
        "Fully remote worker, effectively engaging in distributed teams.",
        "Proven ability to coach and mentor teammates, contributing to the team's overall JavaScript and engineering abilities."
      ]
    }
  },
  "skills": {
    "standard": ["Semantic HTML", "CSS3", "Javascript/ES6+/JSX/Typescript jQuery"],
    "framework": ["ReactJs", "Vite", "NodeJs", "Tailwind", "Babel", "Webpack", "Cypress/Jest"],
    "tools": ["Git", "Github", "Jira", "Figma/Canva", "Midjourney", "GPT","Insomnia/Postman"]

  },
  "Certifications": {
    "Full Stack Web Development": {
      "From": "Rutgers University",
      "Date": "2017",
      "Website": "https://bootcamp.rutgers.edu/coding/",
      "Logo": "https://1000logos.net/wp-content/uploads/2021/07/Rutgers-Scarlet-Knights-logo.png"
    },
    "Modern Javascript From The Beginning": {
      "From": "Udemy",
      "Date": "2020",
      "Website": "https://www.udemy.com/course/modern-javascript-from-the-beginning/",
      "Logo": "https://logowik.com/content/uploads/images/udemy-new-20212512.jpg"
    },
    "React Front to Back": {
      "From": "Udemy",
      "Date": "2021",
      "Website": "https://www.udemy.com/course/modern-react-front-to-back/",
      "Logo": "https://logowik.com/content/uploads/images/udemy-new-20212512.jpg"
    }
  },
  "Experience": {
    "Storis Inc.": {
      "Title": "Front End Developer",
      "Start": "August 2021",
      "bullets": [
        "Led various web development projects, working closely with designers to delegate tasks efficiently. This teamwork has allowed us to launch websites faster and streamline our workflow, making the whole process smoother and more enjoyable for everyone involved.",
        "Collaborated on building numerous websites for top 500 furniture retailers using HTML, CSS, and Javascript, helping to improve their online presence and provide a better experience for their customers.",
        "Written detailed documentation to guide clients in editing and iterating on the custom code we develop in-house. This makes it easy for them to make updates and modifications smoothly.",
        "Developed a reusable component system using HTML, CSS, and Javascript creating a library of custom themes and designs. This innovation significantly reduced development time, allowing us to focus more on designing, implementing, and testing for our clients.",
        "Led a team project to develop a subscription service. This service added maintenance hours for clients, doubling our previous year's revenue and strengthening client relationships.",
        "Led a team project to develop a subscription service. This service added maintenance hours for clients, doubling our previous year's revenue and strengthening client relationships."
      ],
      "Links": {
        "website": "https://www.storis.com/"
      },
      "references": {
        "one": {
          "statement": "Having known Joseph for over a year as their colleague, I am certain that he will thrive as a lead developer due to their continuous drive of excellence and commitment to giving his team the best possible chance to achieve success. During his time working with me, they have always impressed me with his ability to identify the problem and work tirelessly to fix it. Also Joseph has shown his knowledge as a developer to lead project from its infancy to its completion without any hitches and I am therefore confidently able to recommend Joseph Adames based on this experience.",
          "from": "Yerodin Prendergast",
          "Title": "Project Coordinator"
        },
        "two": {
          "statement": "./images/Reccs/Braun.png"
        }
      },
      "Projects": {
        "Grand Home Furniture": {
          "website": "https://www.grandhf.com/"
        },
        "Adcock Furniture": {
          "website": "https://www.adcockfurniture.com/"
        },
        "AFD Furniture": {
          "website": "https://www.afd-furniture.com/"
        },
        "Storis Home": {
          "website": "https://storishome.com"
        }
      }
    },
    "WeatherWorks Inc.": {
      "Title": "Jr. Software Engineer",
      "Start": "March 2020 - March 2021",
      "bullets": [
        "Created internal tools using HTML, CSS, and JavaScript that improved the presentation of data to meteorologists, enhancing their decision-making processes.",
        "Maintained and updated legacy environments using jQuery and PHP, ensuring continued operations.",
        "Participated in regular code reviews, promoting best practices and quality standards within the team.",
        "Leveraged the Vue.js framework to enhance client and internal applications by seamlessly incorporating functional and visual weather data. This involved integrating RESTful APIs, which significantly improved user interfaces and supported better decision-making capabilities."
      ],
      "Links": {
        "website": "https://weatherworksinc.com/"
      },
      "references": {
        "one": {
          "statement": "I was Joe Adames’ direct supervisor at WeatherWorks for the entire year he worked for our company (March 2020 through March 2021). Joe is a passionate software developer, always eager to learn and grow and would make a great addition to a well-established team.We had Joe do front-end development, working with jQuery in our legacy applications and VueJS in our newer applications; technologies in which Joe had little experience initially, but picked up proficiency through practice and hard work. He would do whatever it took to get the job done and get it done right, often improving his code on his own time. The amount of progress he made over the course of the year was impressive, going from a brand-new developer to being able to build out a feature-complete web page.Joe was a great teammate as well, learning from senior developers while also bringing new ideas to the table. He was always respectful, and mindful of everyone’s time. Although we went to fully remote work the day after Joe started with us (due to the pandemic), he was engaged and connected with the rest of the team.",
          "from": "Brian Silviotti",
          "Title": "Director of Software Development"
        },
        "two": {
          "statement": "I worked with Joe on the development team at Weather Works. We worked on a project together and I performed a number of code reviews on his code. Joe took constructive feedback well and implemented suggestions to make his code better. He reached out for help only after he had first spent time trying to figure things on his own. He was open and eager to learn new technologies and to grow. Joe is an effective communicator and a good collaborator. He would make a great addition to an established team.",
          "from": "Theodore Manton",
          "Title": "Web Developer"
        }
      }
    },
    "Selective Insurance": {
      "Title": "Advanced Algorithms & Applications Co-op",
      "Start": "December 2017 - February 2019",
      "summary": "Utilizing my expertise in SQL and programming, I develop and implement various technical solutions, effectively managing databases and software applications. My strong communication, teamwork, and problem-solving skills enable me to collaborate effectively and tackle technical challenges with innovative approaches.",
      "bullets": [
        "Implemented technical solutions via programming and table management using SQL.",
        "Collaborated with a team to develop and deploy various technical solutions.",
        "Demonstrated excellent communication, teamwork, and problem-solving skills."
      ],
      "Links": {
        "website": "https://www.selective.com/"
      }
    }
  },
  "socials": {
    "LinkedIn": {
      "website": "https://www.linkedin.com/in/josephadames/"
    }
  }
}
